from sqlalchemy import create_engine, text

# --- НАСТРОЙКИ ---
DB_URI = "postgresql://postgres:pip1234@localhost:5432/postgres"

# ИСХОДНЫЕ ДАННЫЕ (Строго ваш словарь)
wb_warehouse_clusters = {
    "Армения": ["СЦ Ереван"],
    "Беларусь": ["Минск", "СЦ Брест", "СЦ Гродно"],
    "Грузия": ["СЦ Тбилиси 3 Бонд"],
    "Дальневосточный + Сибирский": ["СЦ Хабаровск", "СЦ Барнаул", "Владивосток", "Юрга", "Новосибирск СГТ", "Хабаровск",
                                    "Новосибирск"],
    "Казахстан": ["СЦ Байсерке", "Атакент", "Актобе", "Астана Карагандинское шоссе"],
    "Приволжский": ["СЦ Ижевск", "СЦ Кузнецк", "Пенза СГТ", "Кузнецк СГТ", "Пенза", "Самара (Новосемейкино)", "Сарапул",
                    "Казань"],
    "Северо-Западный": ["СЦ Вологда 2", "СЦ Шушары", "Санкт-Петербург СГТ", "СПБ Шушары",
                        "Санкт-Петербург Уткина Заводь"],
    "Узбекистан": ["Ташкент", "Ташкент 2"],
    "Уральский": ["Нижний Тагил (Восточное) СГТ", "Челябинск СГТ", "Екатеринбург - Испытателей 14г",
                  "Екатеринбург - Перспективный 12"],
    "Центральный": ["Пушкино", "Вёшки", "Иваново", "Подольск 3", "Радумля 1", "Подольск 4", "Обухово 2", "Чашниково",
                    "Истра", "Коледино: Горючее", "Никольское", "Обухово СГТ", "Голицыно СГТ", "Радумля СГТ",
                    "Софьино СГТ", "Софрино СГТ", "Ярославль СГТ", "Цифровой склад", "Рязань (Тюшевское)",
                    "Рязань (Тюшевское): Питание", "Сабурово", "Владимир", "Тула", "Котовск", "Электросталь", "Воронеж",
                    "Электросталь: Питание", "Обухово", "Коледино", "Белая дача", "Подольск", "Щербинка", "Чехов 1",
                    "Чехов 2", "Белые Столбы"],
    "Южный + Северо-Кавказский": ["Крыловская", "Волгоград", "Невинномысск", "Краснодар"]
}


def fill_strict_warehouse_table():
    engine = create_engine(DB_URI)

    # 1. Пересоздаем таблицу (удаляем старую, если была, чтобы было чисто)
    with engine.begin() as conn:
        conn.execute(text("DROP TABLE IF EXISTS warehouseName_clasters;"))
        conn.execute(text("""
            CREATE TABLE warehouseName_clasters (
                warehouseName TEXT PRIMARY KEY, 
                clusterName TEXT
            );
        """))

    print("Таблица создана.")

    # 2. Формируем список данных
    data_to_insert = []
    for cluster, warehouses_list in wb_warehouse_clusters.items():
        for warehouse in warehouses_list:
            data_to_insert.append({
                "wh": warehouse,
                "cl": cluster
            })

    # 3. Записываем в базу
    insert_sql = text("INSERT INTO warehouseName_clasters (warehouseName, clusterName) VALUES (:wh, :cl)")

    with engine.begin() as conn:
        conn.execute(insert_sql, data_to_insert)

    print(f"Загружено {len(data_to_insert)} строк.")


if __name__ == "__main__":
    fill_strict_warehouse_table()
